# set global preferences for all 'brew install' commands
cask_args appdir: '/Applications', fontdir: '/Library/Fonts', adopt: true

tap "homebrew/bundle"
tap "homebrew/services"
tap "ngrok/ngrok"
tap "twilio/brew"

# Replacements of system equivalents
brew 'bash'
brew 'curl'
brew 'git'
brew 'less'
brew 'rsync'
brew 'vim'
brew 'wget'
brew 'zsh'
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Cloudflare Tunnel client (formerly Argo Tunnel)
brew "cloudflared"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Terminal multiplexer
brew "tmux"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"

# --------------------------------------------------------------
# General Casks

cask "adobe-acrobat-reader"
cask "font-meslo-for-powerlevel10k"
cask "google-chrome"
cask "keyclu"
cask "ngrok"
cask "orbstack"
cask "rectangle"
cask "scroll-reverser"
cask "sloth"
cask "termius"
cask "visual-studio-code"

# --------------------------------------------------------------
# VSCode extensions

vscode "akamud.vscode-theme-onedark"
vscode "arcanis.vscode-zipfs"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-footnotes"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bierner.markdown-yaml-preamble"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "dotenv.dotenv-vscode"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "github.vscode-pull-request-github"
vscode "graphql.vscode-graphql-syntax"
vscode "ibm.output-colorizer"
vscode "james-yu.latex-workshop"
vscode "kamikillerto.vscode-colorize"
vscode "mrmlnc.vscode-scss"
vscode "ms-azuretools.vscode-containers"
vscode "ms-pyright.pyright"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "mtxr.sqltools"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "streetsidesoftware.code-spell-checker"
vscode "stylelint.vscode-stylelint"
vscode "vitest.explorer"
vscode "vscode-icons-team.vscode-icons"
vscode "yoavbls.pretty-ts-errors"

# --------------------------------------------------------------
# Personal casks

cask "aldente"
cask "appcleaner"
cask "coconutBattery"
cask "cursor"
cask "discord"
cask "dropbox"
cask "epic-games"
cask "firefox"
cask "google-drive"
cask "iina"
cask "kobo"
cask "latest"
cask "league-of-legends"
cask "logi-options+"
cask "malwarebytes"
cask "microsoft-auto-update"
cask "microsoft-excel"
cask "microsoft-powerpoint"
cask "microsoft-word"
cask "minecraft"
cask "nvidia-geforce-now"
cask "obsidian"
cask "omnidisksweeper"
cask "onedrive"
cask "parsec"
cask "protonvpn"
cask "pycharm"
cask "spotify"
cask "steam"
cask "the-unarchiver"
cask "tor-browser"
cask "transmission"
cask "zoom"

# Apps without casks:
# - Amphetamine
# - PDFgear
# - Polarr
# - XCode
